---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsGbxmlSurfaceType
source: html/583d3a3a-e32b-3b30-dc31-e3116bebf647.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsGbxmlSurfaceType Property

"Surface Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsGbxmlSurfaceType { get; }
```